cask_args appdir: '/Applications'
tap 'drone/drone'
tap 'jotta/cli'
cask 'java'

# Development

## Language/Runtimes
brew 'go'
brew 'node'
brew 'python'
brew 'python3'
brew 'ocaml'
brew 'elm'
brew 'mono'
brew 'haskell-stack'


## Linting
brew 'tidy-html5'
brew 'swiftlint'
brew 'shellcheck'
brew 'elm-format'
brew 'golangci/tap/golangci-lint'


## Tools
brew 'aria2'
brew 'git'
brew 'git-extras'
# brew 'gradle'
# brew 'maven'
brew 'fzf'
brew 'cloc'
brew 'ninja'
brew 'diff-so-fancy'
brew 'drone'
brew 'nload'
brew 'fdupes'
brew 'fd'
brew 'bat'
brew 'prettyping'
brew 'jotta-cli'
brew 'sleepwatcher'

## Frameworks
brew 'ibm-swift/kitura/kitura'


## IaaS
brew 'terraform'
brew 'packer'
brew 'jsonnet'
brew 'kompose'
brew 'kubernetes-cli'
brew 'helm'

# Package manager
brew 'opam'
brew 'pipx'
brew 'yarn'

# Shells
brew 'fish'
brew 'mosh'

# Command
brew 'xz'
brew 'htop'
brew 'dos2unix'
brew 'gnu-sed'
brew 'findutils'
brew 'coreutils'
brew 'jq'
brew 'yq'
brew 'ncdu'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'neovim'
# brew 'emacs', args: ['with-gnutls', 'with-imagemagick', 'with-cocoa', 'HEAD']
brew 'watch'
brew 'wget'
brew 'readline'

## Network
brew 'ipcalc'
brew 'nmap'
brew 'socat'
brew 'netcat'
brew 'netcat6'

## Database
brew 'sqlite'
brew 'postgresql'
brew 'redis'


## Desktop apps
brew 'cask'
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'balenaetcher'
cask 'iterm2'
cask 'firefox'
cask 'google-chrome'
cask 'chrome-remote-desktop-host'
cask 'iina'
cask 'spectacle'
cask 'spotify'
cask 'teamviewer'
cask 'transmission'
cask 'vlc'
cask 'the-unarchiver'
cask 'discord'
cask 'sequel-pro'
cask 'jumpcut'
cask 'calibre'
cask 'caprine'
cask 'beardedspice'
cask 'tunnelblick'
cask 'free-ruler'
cask 'docker'
cask 'slack'
cask 'visual-studio-code'
cask 'menumeters'
cask 'steam'
cask 'transmit'
cask 'little-snitch'
cask 'tripmode'
cask 'signal'
# cask 'flash-npapi'
# cask 'flash-ppapi'
# cask 'dotnet'
cask 'dotnet-sdk'
cask 'syncthing'

cask 'menubar-colors'
cask 'gas-mask'

cask 'turbo-boost-switcher'
cask 'steveschow-gfxcardstatus'


# cask 'intellij-idea'
# cask 'pycharm'
# cask 'microsoft-office'
# cask 'openra'
# cask 'minikube'
# cask 'mailbutler'
# cask 'real-vnc'

brew 'mas'
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Pixelmator', id: 407963104
mas 'Xcode', id: 497799835
mas 'Patterns', id: 429449079
mas 'Telegram', id: 747648890
mas 'WhatsApp', id: 1147396723
mas 'WireGuard', id: 1451685025
mas 'Pages', id: 409201541
