cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/homebrew-versions'
tap 'grammarly/tap'
tap 'homebrew/bundle'
tap 'homebrew/games'
tap 'homebrew/devel-only'
tap 'homebrew/versions'
tap 'drone/drone'
cask 'java'

# Development

## Language/Runtimes
brew 'dmd'
brew 'erlang'
brew 'go'
brew 'node'
brew 'pypy'
brew 'pypy3'
brew 'python'
brew 'python3'
brew 'scala'
brew 'ocaml'
brew 'rlwrap'
brew 'elm'


## Linting
brew 'flow'
brew 'tidy-html5'
brew 'swiftlint'
brew 'shellcheck'
brew 'elm-format', args: ['devel']


## Tools
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'gradle'
brew 'maven'
brew 'watchman'
brew 'fzf'
brew 'cloc'
brew 'zinc' # Scala incremental build server
brew 'ninja' # small build system
brew 'diff-so-fancy'
brew 'tig'
brew 'drone'
brew 'nload'

## Libs
brew 'boost'
brew 'openssl'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'

# Package manager
brew 'homebrew/versions/rebar3'
brew 'opam'

# Shells
brew 'fish'

# Command
brew 'xz'
brew 'pcre'
brew 'htop'
brew 'cowsay'
brew 'dos2unix'
brew 'figlet'
brew 'gnu-sed', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'coreutils'
brew 'jq'
brew 'ncdu'
brew 'gpg'
brew 'testssl'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'unrar'
brew 'vim'
brew 'emacs', args: ['with-gnutls', 'with-imagemagick', 'with-cocoa', 'HEAD']
brew 'watch'
brew 'wget'
brew 'readline'

## Network
brew 'ipcalc'
brew 'ipv6calc'
brew 'wrk'
brew 'ptunnel'
brew 'nmap'
brew 'socat'
brew 'netcat'
brew 'netcat6'
brew 'syncthing'

## Database
brew 'sqlite'
brew 'postgresql'

brew 'cask'
cask 'safari-technology-preview'
cask 'wireshark'
cask 'iterm2-beta'
cask 'tigervnc-viewer'
cask 'betterzipql'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'mplayerx'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'skype'
cask 'spectacle'
cask 'spotify'
cask 'teamviewer'
cask 'transmission'
cask 'vlc'
cask 'jotta'
cask 'grammarly'
cask 'the-unarchiver'
cask 'discord'
cask 'sequel-pro'
cask 'nimble'
cask 'jumpcut'
cask 'messenger'
#cask 'goofy'
#cask 'chitchat'
cask 'calibre'
cask 'beardedspice'
cask 'tunnelblick'
cask 'free-ruler'
cask 'docker'
cask 'duet'
cask 'slack-beta'
cask 'visual-studio-code'
cask 'yujitach-menumeters'
cask 'steam'
cask 'franz'

cask 'osxfuse'
cask 'sshfs'

cask 'intellij-idea'
cask 'pycharm'
cask 'microsoft-office'
cask 'openra'

