cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/homebrew-versions'
tap 'grammarly/tap'
tap 'homebrew/devel-only'
tap 'drone/drone'
cask 'java'

# Development

## Language/Runtimes
brew 'dmd'
brew 'erlang'
brew 'go'
brew 'node'
brew 'pypy'
brew 'pypy3'
brew 'python'
brew 'python3'
brew 'scala'
brew 'ocaml'
brew 'rlwrap'
brew 'elm'
brew 'mono'


## Linting
brew 'flow'
brew 'tidy-html5'
brew 'swiftlint'
brew 'shellcheck'
brew 'elm-format', args: ['devel']
brew 'golangci/tap/golangci-lint'


## Tools
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'gradle'
brew 'maven'
brew 'watchman'
brew 'fzf'
brew 'cloc'
brew 'zinc' # Scala incremental build server
brew 'ninja' # small build system
brew 'diff-so-fancy'
brew 'tig'
brew 'drone'
brew 'nload'
brew 'lastpass-cli', args: ['with-pinentry', 'with-doc']
brew 'fdupes'
brew 'fd'
brew 'bat'
brew 'prettyping'

## DevOps
brew 'terraform'
brew 'packer'

## Libs
brew 'boost'
brew 'openssl'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'

# Package manager
brew 'opam'
brew 'nuget'

# Shells
brew 'fish'

# Command
brew 'xz'
brew 'pcre'
brew 'htop'
brew 'cowsay'
brew 'dos2unix'
brew 'figlet'
brew 'gnu-sed', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'coreutils'
brew 'jq'
brew 'ncdu'
brew 'gpg'
brew 'testssl'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unar'
brew 'unrar'
brew 'vim'
# brew 'emacs', args: ['with-gnutls', 'with-imagemagick', 'with-cocoa', 'HEAD']
brew 'watch'
brew 'wget'
brew 'readline'

## Network
brew 'ipcalc'
brew 'ipv6calc'
brew 'wrk'
brew 'ptunnel'
brew 'nmap'
brew 'socat'
brew 'netcat'
brew 'netcat6'
brew 'syncthing'

## Database
brew 'sqlite'
brew 'postgresql'

brew 'cask'
# cask 'safari-technology-preview'
cask 'wireshark'
cask 'iterm2'
cask 'tigervnc-viewer'
cask 'betterzipql'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'chrome-remote-desktop-host'
cask 'mplayerx'
cask 'iina'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
# cask 'skype'
cask 'spectacle'
cask 'spotify'
cask 'teamviewer'
cask 'transmission'
cask 'vlc'
cask 'jotta'
# cask 'grammarly'
cask 'the-unarchiver'
cask 'discord'
cask 'sequel-pro'
cask 'nimble'
cask 'jumpcut'
# cask 'messenger'
# cask 'goofy'
# cask 'chitchat'
cask 'calibre'
cask 'beardedspice'
cask 'tunnelblick'
cask 'free-ruler'
cask 'docker'
# cask 'duet'
cask 'slack'
cask 'visual-studio-code'
cask 'yujitach-menumeters'
cask 'steam'
# cask 'franz'
cask 'lastpass'
cask 'transmit'
cask 'transmit-disk'

# cask 'osxfuse'
# cask 'sshfs'

# cask 'xquartz'
# cask 'inkscape'

# cask 'intellij-idea'
# cask 'pycharm'
# cask 'microsoft-office'
# cask 'openra'
cask 'vmware-fusion'
cask 'minikube'
cask 'mailbutler'
cask 'real-vnc'
cask 'dotnet'
cask 'syncthing-app'

cask 'menubar-colors'
cask 'gas-mask'

brew 'mas'
mas 'LastPass', id: 926036361
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Pixelmator', id: 407963104
mas 'Twitter', id: 409789998
mas 'Xcode', id: 497799835
mas 'Trello', id: 1278508951
